ARMmbed/mbed-os/libraries/mbed/targets/hal/TARGET_Silicon_Labs/TARGET_EFM32/serial_api.c
    /* All events should have generated a return, if no return has happened, no event has been caught */
    return 0;
}

/** Unified IRQ handler. Determines the appropriate handler to execute and returns the flags.
 *
 * WARNING: this code should be stateless, as re-entrancy is very possible in interrupt-based mode.
 */
int serial_irq_handler_asynch(serial_t *obj)
{
    /* First, check if we're running in DMA mode */
    if(serial_dma_irq_fired[obj->serial.dmaOptionsRX.dmaChannel]) {
        /* Clean up */
        serial_dma_irq_fired[obj->serial.dmaOptionsRX.dmaChannel] = false;
        serial_rx_abort_asynch(obj);

        /* Notify CPP land of RX completion */
        return SERIAL_EVENT_RX_COMPLETE & obj->serial.events;
    } else if (serial_dma_irq_fired[obj->serial.dmaOptionsTX.dmaChannel]) {
        if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
            if(obj->serial.periph.leuart->IEN & LEUART_IEN_TXC){
                LEUART_IntDisable(obj->serial.periph.leuart,LEUART_IEN_TXC);
                /* Clean up */
                serial_dma_irq_fired[obj->serial.dmaOptionsTX.dmaChannel] = false;
                serial_tx_abort_asynch(obj);
                /* Notify CPP land of completion */
                return SERIAL_EVENT_TX_COMPLETE & obj->serial.events;
            }else{
                LEUART_IntEnable(obj->serial.periph.leuart,LEUART_IEN_TXC);
            }
        }else{
            if(obj->serial.periph.uart->IEN & USART_IEN_TXC){
                USART_IntDisable(obj->serial.periph.uart,USART_IEN_TXC);
                /* Clean up */
                serial_dma_irq_fired[obj->serial.dmaOptionsTX.dmaChannel] = false;
                serial_tx_abort_asynch(obj);
                /* Notify CPP land of completion */
                return SERIAL_EVENT_TX_COMPLETE & obj->serial.events;
            }else{
                USART_IntEnable(obj->serial.periph.uart,USART_IEN_TXC);
            }
        }
    } else {
        /* Check the NVIC to see which interrupt we're running from
         * Also make sure to prioritize RX */
        if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
            //Different method of checking tx vs rx for LEUART
            if(LEUART_IntGetEnabled(obj->serial.periph.leuart) & (LEUART_IF_RXDATAV | LEUART_IF_FERR | LEUART_IF_PERR | LEUART_IF_RXOF)) {
                return serial_rx_irq_handler_asynch(obj);
            } else if(LEUART_StatusGet(obj->serial.periph.leuart) & (LEUART_STATUS_TXBL | LEUART_STATUS_TXC)) {
                return serial_tx_irq_handler_asynch(obj);
            }
        } else {
            if(USART_IntGetEnabled(obj->serial.periph.uart) & (USART_IF_RXDATAV | USART_IF_RXOF | USART_IF_PERR | USART_IF_FERR)) {
                return serial_rx_irq_handler_asynch(obj);
            } else if(USART_StatusGet(obj->serial.periph.uart) & (USART_STATUS_TXBL | USART_STATUS_TXC)){
                return serial_tx_irq_handler_asynch(obj);
            }
        }
    }

    // All should be done now
    return 0;
}

/** Abort the ongoing TX transaction. It disables the enabled interupt for TX and
 *  flush TX hardware buffer if TX FIFO is used
 *
 * @param obj The serial object
 */
void serial_tx_abort_asynch(serial_t *obj)
{
    /* Stop transmitter */
    //obj->serial.periph.uart->CMD |= USART_CMD_TXDIS;

    /* Clean up */
    switch(obj->serial.dmaOptionsTX.dmaUsageState) {
        case DMA_USAGE_ALLOCATED:
            /* stop DMA transfer */
            DMA_ChannelEnable(obj->serial.dmaOptionsTX.dmaChannel, false);
            break;
        case DMA_USAGE_TEMPORARY_ALLOCATED:
            /* stop DMA transfer and release channel */
            DMA_ChannelEnable(obj->serial.dmaOptionsTX.dmaChannel, false);
            dma_channel_free(obj->serial.dmaOptionsTX.dmaChannel);
            obj->serial.dmaOptionsTX.dmaChannel = -1;
            obj->serial.dmaOptionsTX.dmaUsageState = DMA_USAGE_OPPORTUNISTIC;
            break;
        default:
            /* stop interrupting */
            if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
                LEUART_IntDisable(obj->serial.periph.leuart, LEUART_IEN_TXC);
                LEUART_IntClear(obj->serial.periph.leuart, LEUART_IFC_TXC);
            } else {
                USART_IntDisable(obj->serial.periph.uart, USART_IEN_TXC);
                USART_IntClear(obj->serial.periph.uart, USART_IFC_TXC);
            }
            break;
    }

    /* Say that we can stop using this emode */
#ifdef LEUART_USING_LFXO
    if(LEUART_REF_VALID(obj->serial.periph.leuart) && (LEUART_BaudrateGet(obj->serial.periph.leuart) <= (LEUART_LF_REF_FREQ/2))){
        unblockSleepMode(SERIAL_LEAST_ACTIVE_SLEEPMODE_LEUART);
    }else{
        unblockSleepMode(SERIAL_LEAST_ACTIVE_SLEEPMODE);
    }
#else
    unblockSleepMode(SERIAL_LEAST_ACTIVE_SLEEPMODE);
#endif
}

/** Abort the ongoing RX transaction It disables the enabled interrupt for RX and
 *  flush RX hardware buffer if RX FIFO is used
 *
 * @param obj The serial object
 */
void serial_rx_abort_asynch(serial_t *obj)
{
    /* Stop receiver */
    obj->serial.periph.uart->CMD |= USART_CMD_RXDIS;

    /* Clean up */
    switch(obj->serial.dmaOptionsRX.dmaUsageState) {
        case DMA_USAGE_ALLOCATED:
            /* stop DMA transfer */
            DMA_ChannelEnable(obj->serial.dmaOptionsRX.dmaChannel, false);
            break;
        case DMA_USAGE_TEMPORARY_ALLOCATED:
            /* stop DMA transfer and release channel */
            DMA_ChannelEnable(obj->serial.dmaOptionsRX.dmaChannel, false);
            dma_channel_free(obj->serial.dmaOptionsRX.dmaChannel);
            obj->serial.dmaOptionsRX.dmaChannel = -1;
            obj->serial.dmaOptionsRX.dmaUsageState = DMA_USAGE_OPPORTUNISTIC;
            break;
        default:
            /* stop interrupting */
            if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
                LEUART_IntDisable(obj->serial.periph.leuart, LEUART_IEN_RXDATAV | LEUART_IEN_PERR | LEUART_IEN_FERR | LEUART_IEN_RXOF);
            } else {
                USART_IntDisable(obj->serial.periph.uart, USART_IEN_RXDATAV | USART_IEN_PERR | USART_IEN_FERR | USART_IEN_RXOF);
            }
            break;
    }

    /*clear all set interrupts*/
    if(LEUART_REF_VALID(obj->serial.periph.leuart)) {
        LEUART_IntClear(obj->serial.periph.leuart, LEUART_IFC_PERR | LEUART_IFC_FERR | LEUART_IFC_RXOF);
    }else{
        USART_IntClear(obj->serial.periph.uart,  USART_IFC_PERR | USART_IFC_FERR | USART_IFC_RXOF);
    }

    /* Say that we can stop using this emode */
#ifdef LEUART_USING_LFXO
    if(LEUART_REF_VALID(obj->serial.periph.leuart) && (LEUART_BaudrateGet(obj->serial.periph.leuart) <= (LEUART_LF_REF_FREQ/2))){
        unblockSleepMode(SERIAL_LEAST_ACTIVE_SLEEPMODE_LEUART);
    }else{
        unblockSleepMode(SERIAL_LEAST_ACTIVE_SLEEPMODE);
    }
#else
    unblockSleepMode(SERIAL_LEAST_ACTIVE_SLEEPMODE);
#endif
}

#endif //DEVICE_SERIAL_ASYNCH
#endif //DEVICE_SERIAL
